{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 48, 48, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "filters": 64, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 1024, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 1024, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_5", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 9, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}]}, "backend": "cntk"}