{"config": {"layers": [{"config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 64, "batch_input_shape": [null, 48, 48, 1], "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "filters": 128, "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "filters": 256, "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "activation": "softmax", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "cntk", "keras_version": "2.2.4"}